# Here we will discuss about subsetting

In [31]:
# import module
import pandas as pd 
import numpy as np

In [3]:
# Load the DataSet
temp = pd.read_csv('temperatures.csv')

In [4]:
temp.head()

   Unnamed: 0        date     city        country  avg_temp_c
0           0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1           1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2           2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3           3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4           4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [5]:
temp.shape

(16500, 5)

In [6]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16500 entries, 0 to 16499
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  16500 non-null  int64
 1   date        16500 non-null  object
 2   city        16500 non-null  object
 3   country     16500 non-null  object
 4   avg_temp_c  16407 non-null  float64
dtypes: float64(1), int64(1), object(3)
memory usage: 644.7+ KB

In [7]:
#we see that we have an undesired column
#Drop the Unnamed: 0 column
temp.drop("Unnamed: 0", axis=1, inplace=True)

In [8]:
temp.head()

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [9]:
#summary statistic about numerical data
temp.describe()

         avg_temp_c
count  16407.000000
mean      19.732877
std        9.579635
min      -23.495000
25%       14.870000
50%       22.119000
75%       27.001500
max       38.283000

In [10]:
temp

             date     city        country  avg_temp_c
0      2000-01-01  Abidjan  Côte D'Ivoire      27.293
1      2000-02-01  Abidjan  Côte D'Ivoire      27.685
2      2000-03-01  Abidjan  Côte D'Ivoire      29.061
3      2000-04-01  Abidjan  Côte D'Ivoire      28.162
4      2000-05-01  Abidjan  Côte D'Ivoire      27.547
...           ...      ...            ...         ...
16495  2013-05-01     Xian          China      18.979
16496  2013-06-01     Xian          China      23.522
16497  2013-07-01     Xian          China      25.251
16498  2013-08-01     Xian          China      24.528
16499  2013-09-01     Xian          China         NaN

[16500 rows x 4 columns]

# Now we will extract all the average temperature between 2000-01-01 and 2004-01-01, 2004-01-02 and 2008-01-01
# , 2008-01-02 and 2013-09-01 to see the evolution of temperature and the extent of climate change from year to year

In [12]:
temp1 = temp['date']<= "2004-01-01"
avg_temp1 = temp[temp1]
avg_temp1.mean(), avg_temp1.shape

(avg_temp_c    19.525467
 dtype: float64,
 (4900, 4))

In [26]:
# Subset the country with the highest and smallest temperature
avg_temp1["avg_temp_c"].max()

38.283

In [27]:
avg_temp1[avg_temp1['avg_temp_c']==38.283]

           date     city country  avg_temp_c
996  2000-07-01  Baghdad    Iraq      38.283

In [28]:
avg_temp1["avg_temp_c"].min()

-23.495

In [29]:
avg_temp1[avg_temp1['avg_temp_c']==-23.495]

            date    city country  avg_temp_c
5622  2001-01-01  Harbin   China     -23.495

In [15]:
#temperature between 2004-01-02 and 2008-01-01
temp_upper_to_04 = temp['date']>"2004-01-02"
temp_lower_to_08 = temp['date']<="2008-01-01"
avg_temp2 = temp[temp_upper_to_04 & temp_lower_to_08]
avg_temp2

             date     city        country  avg_temp_c
49     2004-02-01  Abidjan  Côte D'Ivoire      28.705
50     2004-03-01  Abidjan  Côte D'Ivoire      29.288
51     2004-04-01  Abidjan  Côte D'Ivoire      28.152
52     2004-05-01  Abidjan  Côte D'Ivoire      27.302
53     2004-06-01  Abidjan  Côte D'Ivoire      25.712
...           ...      ...            ...         ...
16427  2007-09-01     Xian          China      17.669
16428  2007-10-01     Xian          China      11.421
16429  2007-11-01     Xian          China       6.756
16430  2007-12-01     Xian          China       0.279
16431  2008-01-01     Xian          China      -4.311

[4800 rows x 4 columns]

In [16]:
avg_temp2['avg_temp_c'].mean()

19.725062500000096

In [34]:
# Subset the country with the highest and smallest temperature
avg_temp2['avg_temp_c'].min()

-18.862

In [18]:
avg_temp2[avg_temp2['avg_temp_c']==-18.862]

            date    city country  avg_temp_c
5682  2006-01-01  Harbin   China     -18.862

In [19]:
avg_temp2['avg_temp_c'].max()

37.041

In [20]:
avg_temp2[avg_temp2['avg_temp_c']==37.041]

            date     city country  avg_temp_c
1069  2006-08-01  Baghdad    Iraq      37.041

In [33]:
#temperature between 2008-01-02 and 2013-09-01
temp_upper_to_8 = temp['date']>="2008-01-02"
temp_lower_to_13= temp['date']<="2013-09-01"
avg_temp3 = temp[temp_upper_to_8 & temp_lower_to_13]
avg_temp3.mean()

avg_temp_c    19.889998
dtype: float64

In [32]:
# Subset the country with the highest and smallest temperature
avg_temp3['avg_temp_c'].max()

37.899

In [23]:
avg_temp3[avg_temp3['avg_temp_c']==37.899]

            date     city country  avg_temp_c
1117  2010-08-01  Baghdad    Iraq      37.899

In [24]:
avg_temp3['avg_temp_c'].min()

-22.029

In [25]:
avg_temp3[avg_temp3['avg_temp_c']==-22.029]

            date    city country  avg_temp_c
5742  2011-01-01  Harbin   China     -22.029